api/app/controllers/api/authentication/users_controller.rb

      def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "name", "phone", "jti", "created_at", "updated_at") VALUES ('beto@gmail.com', '$2a$12$tiVN.KnPOd390R0uRmCsJ.weFtAUk1XmFLi8dRiQfQgU2cDGC9GxG', NULL, NULL, 'Roberto', '5548996239568', 'c5cc7011-c7f6-4784-ae12-314a37651b10', '2026-06-14 07:02:45.179777', '2026-06-14 07:02:45.179777') RETURNING "id"

      def load_users
        @users = User.all
---
SELECT "users".* FROM "users"